package lesson2homework;
//Составьте программу, выводящую на экран квадраты чисел от 10 до 20 включительно
public class Task11 {
    public static void main (String [] args){
        int a;
        a=10;
        for(int i=0; i<=10; i++){
            System.out.println(a*a);
            a=a+1;
        }
    }
}
